InformationRegisters/НастройкиИнтеграцииСПлатежнымиСистемамиУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииСПлатежнымиСистемамиУТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Интеграция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКСистемеБыстрыхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПлатежнаяСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлатежнойСистемыККТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариантНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНастройкиСБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииСПлатежнымиСистемамиУТ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений с действующими договорами и их настройками интеграции.
// 
// Параметры:
//  ВариантНастройки - ПеречислениеСсылка.ВариантыНастройкиСБП, Неопределено - вариант настройки СБП.
// 
// Возвращаемое значение:
//	ТаблицаЗначений:
//		*Договор - СправочникСсылка.ДоговорыЭквайринга - 
//		*Магазин - СправочникСсылка.Склады - 
//		*Интеграция - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей - 
Функция ДействующиеДоговораСНастройкамиИнтеграции(ВариантНастройки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор КАК Договор,
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Магазин КАК Магазин,
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция КАК Интеграция
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
	|ГДЕ
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор.Статус = &СтатусыДоговоровКонтрагентовДействует
	|	И НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция.Используется
	|	И НЕ НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор.ПометкаУдаления
	|	И НЕ НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция = &НастройкиПодключенияСБППустаяСсылка
	|	И (&ВариантНастройки = НЕОПРЕДЕЛЕНО ИЛИ НастройкиИнтеграцииСПлатежнымиСистемамиУТ.ВариантНастройки = &ВариантНастройки)
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор.Номер,
	|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Магазин.Наименование";
	Запрос.УстановитьПараметр(
		"СтатусыДоговоровКонтрагентовДействует",
		Перечисления.СтатусыДоговоровКонтрагентов.Действует);
	Запрос.УстановитьПараметр(
		"НастройкиПодключенияСБППустаяСсылка",
		Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВариантНастройки", ВариантНастройки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.26.37";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("aba6595d-23ef-4502-9177-799bbd4eb0e3");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.ЗарегистрироватьДанныеКОбработке";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Некритичный;
	Обработчик.Комментарий = НСтр("ru = 'Заполнение нового измерения ""Вариант настройки"" в регистре сведений ""Настройки интеграции с платежными системами""'");
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Справочники.НастройкиПодключенияКСистемеБыстрыхПлатежей.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");
	
КонецПроцедуры

// Регистрирует к обработке записи независимого регистра.
// 
// Параметры:
//  Параметры - См. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки.
//
Процедура ЗарегистрироватьДанныеКОбработке(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки; // см. ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляМногопоточнойОбработки
	ПараметрыВыборки.ПолныеИменаРегистров = Метаданные.РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.ПолноеИмя();
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор КАК Договор,
		|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Магазин КАК Магазин
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
		|ГДЕ
		|	НастройкиИнтеграцииСПлатежнымиСистемамиУТ.ВариантНастройки = ЗНАЧЕНИЕ(Перечисление.ВариантыНастройкиСБП.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.Вставить("ЭтоНезависимыйРегистрСведений", Истина);
	ДополнительныеПараметры.Вставить("ПолноеИмяРегистра", "РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, РезультатЗапроса, ДополнительныеПараметры);

КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = Метаданные.РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.ПолноеИмя();
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
		
	КонецЕсли;
	
	ОбработаноЗаписей = 0;
	ПроблемныхОбъектов = 0;
	ИсключенияПриОбновлении = Новый Массив;
	
	СписокОписаний = Новый Массив;
	СписокОписаний.Добавить(НСтр("ru = 'Не удалось обработать набор записей регистра ""Настройки интеграции с платежными системами"" по обработчику'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеДляОбновления.Договор КАК Договор,
		|	ДанныеДляОбновления.Магазин КАК Магазин
		|ПОМЕСТИТЬ ТаблицаДанных
		|ИЗ
		|	&ДанныеДляОбновления КАК ДанныеДляОбновления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДанных.Договор КАК Договор,
		|	ТаблицаДанных.Магазин КАК Магазин,
		|	ЕСТЬNULL(НастройкиПодключенияКСистемеБыстрыхПлатежей.ВариантНастройки, ЗНАЧЕНИЕ(Перечисление.ВариантыНастройкиСБП.c2b)) КАК ВариантНастройки
		|ИЗ
		|	ТаблицаДанных КАК ТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ КАК НастройкиИнтеграцииСПлатежнымиСистемамиУТ
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей КАК НастройкиПодключенияКСистемеБыстрыхПлатежей
		|			ПО НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Интеграция = НастройкиПодключенияКСистемеБыстрыхПлатежей.Ссылка
		|		ПО ТаблицаДанных.Договор = НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Договор
		|			И ТаблицаДанных.Магазин = НастройкиИнтеграцииСПлатежнымиСистемамиУТ.Магазин";
	
	Запрос.УстановитьПараметр("ДанныеДляОбновления", ОбновляемыеДанные);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПричинаИсключения = "";
		Рекомендация = "";
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка";
			
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Договор", Выборка.Договор);
			ЭлементБлокировки.УстановитьЗначение("Магазин", Выборка.Магазин);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			ПричинаИсключения = "ПлохиеДанные";
			Рекомендация = НСтр("ru = 'Заполните данные вручную.'");
			
			ЗаписьИзменена = Ложь;
			
			НаборЗаписей = РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемамиУТ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Договор.Установить(Выборка.Договор);
			НаборЗаписей.Отбор.Магазин.Установить(Выборка.Магазин);
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись Из НаборЗаписей Цикл
				
				Если Запись.ВариантНастройки = Перечисления.ВариантыНастройкиСБП.ПустаяСсылка() Тогда
					Запись.ВариантНастройки = Выборка.ВариантНастройки;
					ЗаписьИзменена = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			ПричинаИсключения = "Запись";
			
			Если ЗаписьИзменена Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ОбработаноЗаписей = ОбработаноЗаписей + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ШаблонСообщения = НСтр("ru = 'Не удалось обработать набор записей по регистру ""Настройки интеграции с платежными системами"" по причине: %1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				НаборЗаписей.Метаданные(),
				Выборка.Договор,
				ТекстСообщения);
			
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				
				ОписаниеПроблемы = ОбновлениеИнформационнойБазыУТ.ПроблемаСДанными(
					НаборЗаписей, Рекомендация, ИнформацияОбОшибке());
				ИсключенияПриОбновлении.Добавить(ОписаниеПроблемы);
				
			ИначеЕсли ПричинаИсключения = "Запись" Тогда
				
				ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(
					ИсключенияПриОбновлении, ОбработаноЗаписей, Параметры);
				ВызватьИсключение СтрСоединить(СписокОписаний, Символы.ПС);
				
			КонецЕсли;
			
		КонецПопытки;
			
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена =
		ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Если ОбработаноЗаписей = 0 И ПроблемныхОбъектов <> 0 Тогда
		
		СписокОписаний.Добавить(НСтр("ru = 'Всего пропущено: %1'"));
		ТекстСообщения = СтрШаблон(СтрСоединить(СписокОписаний, Символы.ПС), ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыУТ.ЗаписатьПлохиеДанные(ИсключенияПриОбновлении, ОбработаноЗаписей, Параметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
